
_ACCENT = '\u0301'

contractions = {
    "C":"[бкдфгхлмнпрствжзнйш]",
    "V":"[аиоуэ]",
    "I":"[яиёюе]",
    "J":"[яёюе]",
    "'": _ACCENT,
    "_":"",
    "#":" "
}

rules = '''
    
    ɟ->gʲ  ç->xʲ  ɲ->ŋʲ  c->kʲ
    [aæʌɑ]->а [iɪ]->и [oɔ]->о [uʊw]->у [eɛəɚɜɝ]->э ʤ->дж
    b->б k->к [dð]->д f->ф [gɡɣ]->г [hx]->х [ɫl]->л m->м [nŋ]->н 
    p->п [rɹ]->р s->с t->т v->в ʒ->ж z->з j->й ʃ->ш θ->ф
    ʲа->я  ʲи->и  ʲо->ё  ʲу->ю  ʲэ->е
    ʲ->ь

    ˈ->'
    ˌ->_
    ː->'
    'CCV->CCV:
    'CV->CV:
    'V->V: 
    :->'

    Cй[аоуэ]->Cъй[аоуэ] 
    й[аоуэ] -> [яёюе]
    
'''